homer1013/BasaltOS/boards/esp32-cyd/sdkconfig.defaults
# ESP32 CYD (ESP32-D0WD-V3) baseline defaults
CONFIG_IDF_TARGET="esp32"

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size (ESP32 CYD is commonly 4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
